In [71]:
print("hello world")

hello world

In [72]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [73]:
data=pd.read_csv('marketing_campaign.csv',sep="\t")

In [74]:
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [75]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [76]:
data.isnull().sum()

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                 24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

In [77]:
data=data.dropna()

In [78]:
data.isnull().sum()

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

## 1. children \
2 martial ststus

In [79]:
data['Children']=data['Kidhome']+data['Teenhome']

In [80]:
data.drop(['Kidhome','Teenhome','Z_Revenue','Z_CostContact'],axis=1,inplace=True)

In [81]:
data['Marital_Status'].value_counts()

Marital_Status
Married     857
Together    573
Single      471
Divorced    232
Widow        76
Alone         3
Absurd        2
YOLO          2
Name: count, dtype: int64

In [82]:
Marimapdic={
    'Married' : 'Partner',
    'Together': 'Partner', 
    'Single'  : 'Single',
    'Divorced' : 'Single',
    'Widow'   : 'Single',
    'Alone'   : 'Single',
    'Absurd'  : 'Single',
    'YOLO'    :  'Single'
}

In [83]:

data['Marital_Status']=data['Marital_Status'].map(Marimapdic)

In [84]:
data.isnull().sum()

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Response               0
Children               0
dtype: int64

In [85]:
data['Marital_Status'].value_counts()

Marital_Status
Partner    1430
Single      786
Name: count, dtype: int64

In [86]:
data['Education'].value_counts()

Education
Graduation    1116
PhD            481
Master         365
2n Cycle       200
Basic           54
Name: count, dtype: int64

In [87]:
Edumapdic={
    'Graduation':'Graduate','2n Cycle':'Post Graduation',
    'PhD':'Doctorate','Master':'Post Graduation','Basic':'Basic'
}

In [88]:
data['Education']=data['Education'].map(Edumapdic)

In [89]:
data['Education'].value_counts()

Education
Graduate           1116
Post Graduation     565
Doctorate           481
Basic                54
Name: count, dtype: int64

In [90]:
data['family size']=(data['Marital_Status'].replace({"Single":1,"Partner":2})+data['Children'])

/tmp/ipykernel_2293/4209556380.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['family size']=(data['Marital_Status'].replace({"Single":1,"Partner":2})+data['Children'])

In [98]:
data.head()

,ID,Year_Birth,Education,Marital_Status,Income,Dt_Customer,Recency,MntWines,MntFruits,MntMeatProducts,...,AcceptedCmp1,AcceptedCmp2,Complain,Response,Children,family size,Total spent,Age,Age classification,Income Classification
0,5524,1957,Graduate,Single,58138.0,04-09-2012,58,635,88,546,...,0,0,0,1,0,1,1617,67,Retirees,Middle
1,2174,1954,Graduate,Single,46344.0,08-03-2014,38,11,1,6,...,0,0,0,0,2,3,27,70,Retirees,Middle
2,4141,1965,Graduate,Partner,71613.0,21-08-2013,26,426,49,127,...,0,0,0,0,0,2,776,59,Pre-Retirement,Middle
3,6182,1984,Graduate,Partner,26646.0,10-02-2014,26,11,4,20,...,0,0,0,0,1,3,53,40,Mid Career,Middle
4,5324,1981,Doctorate,Partner,58293.0,19-01-2014,94,173,43,118,...,0,0,0,0,1,3,422,43,Mid Career,Middle

In [92]:
data['Total spent']=data[[  'MntWines'
                            ,'MntFruits'
                            ,'MntMeatProducts'
                            ,'MntFishProducts'
                            ,'MntSweetProducts'
                            ,'MntGoldProds' ]].sum(axis='columns')

In [94]:
data['Age']=2024-data['Year_Birth']
#bins=[0,25,55,100]
#labels=['Young','Adult','Senior']

bins = [0, 18, 24, 34, 44, 54, 64, 74,float('inf')]
labels = ['Children and Adolescents', 'Young Adults', 
          'Early Career', 'Mid Career', 'Experienced', 
          'Pre-Retirement', 'Retirees','Seniors']

data['Age classification']=pd.cut(data['Age'],bins=bins,labels=labels,right=False)

In [96]:
data['Age classification'].value_counts()

Age classification
Experienced                 697
Pre-Retirement              528
Retirees                    473
Mid Career                  337
Seniors                     138
Early Career                 43
Children and Adolescents      0
Young Adults                  0
Name: count, dtype: int64

In [97]:
bins = [0, 20000, 100000, float('inf')]
labels = ['Low', 'Middle', 'High']
# Apply pd.cut
data['Income Classification'] = pd.cut(data['Income'], bins=bins, labels=labels, right=False)

In [100]:
data['Customer status']=data['Age classification'].astype(str)+' - '+data['Income Classification'].astype(str)

In [101]:
data['Customer status'].value_counts()

Customer status
Experienced - Middle       644
Pre-Retirement - Middle    510
Retirees - Middle          459
Mid Career - Middle        294
Seniors - Middle           133
Experienced - Low           45
Mid Career - Low            41
Early Career - Middle       36
Pre-Retirement - Low        17
Retirees - Low              14
Experienced - High           8
Early Career - Low           7
Seniors - Low                3
Mid Career - High            2
Seniors - High               2
Pre-Retirement - High        1
Name: count, dtype: int64